# ------------------------------------------------

# Петя и Катя – брат и сестра. Петя – студент,
# а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает
# две подсказки. Он называет сумму этих чисел S
# и их произведение P. Помогите Кате отгадать задуманные Петей числа.

# https://www.webmath.ru/poleznoe/formules_19_5.php

from time import time

# 1_000_000_001 1_000_000_000
s = int(input("Сумма: "))
p = int(input("Произведение: "))
answer = "Решить невозможно."

start = time()

d = s ** 2 - 4 * p
if d >= 0:
    x_1 = (s + d ** 0.5) // 2
    x_2 = (s - d ** 0.5) // 2
    if x_1 * x_2 == p:
        answer = f"{x_1}, {x_2}"

print(answer)
print(time() - start)